////////////////////////////////////////////////////////////////////////////////
// Подсистема Кубус
// https://github.com/ibrusniak/Qubus
//
// Модуль 'КубусСтроковыеЗначенияКлиентСервер'
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция Все() Экспорт
	
	С = Новый Структура("Ошибки",
		Новый Структура());
	
	ДополнитьСтроковымиЗначениямиОшибок(С.Ошибки);
	
	Возврат С;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьСтроковымиЗначениямиОшибок(Структура)

	Структура.Вставить("СериализацииВJson",
		НСтр("en = 'Error serializing object to JSON';
		|ru = 'Ошибка сериализации объекта в JSON';
		|uk = 'Помилка серіалізації об''єкта у JSON'"));
	
	Структура.Вставить("ДесериализацииИзJson",
		НСтр("en = 'Error deserializing object from JSON';
		|ru = 'Ошибка десериализации объекта из JSON';
		|uk = 'Помилка десеріалізації об''єкта з JSON'"));
	
	Структура.Вставить("НеверныйШаблонВалидации",
		НСтр("en = 'Invalid validation pattern';
		|ru = 'Неверный шаблон валидации';
		|uk = 'Некоректний шаблон валідації'"));
	
КонецПроцедуры

#КонецОбласти
