////////////////////////////////////////////////////////////////////////////////
// Подсистема Кубус
// https://github.com/ibrusniak/Qubus
//
// Модуль 'КубусСтроковыеЗначенияКлиентСервер'
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция Все() Экспорт
	
	С = Новый Структура("Ошибки",
		Новый Структура());
	
	ДополнитьСтроковымиЗначениямиОшибок(С.Ошибки);
	ДополнитьСтроковымиЗначениямиОшибокВалидации(С.Ошибки);
	
	Возврат С;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьСтроковымиЗначениямиОшибок(Структура)

	Структура.Вставить("СериализацииВJson",
		НСтр("en = 'Error serializing object to JSON';
		|ru = 'Ошибка сериализации объекта в JSON';
		|uk = 'Помилка серіалізації об''єкта у JSON'"));
	
	Структура.Вставить("ДесериализацииИзJson",
		НСтр("en = 'Error deserializing object from JSON';
		|ru = 'Ошибка десериализации объекта из JSON';
		|uk = 'Помилка десеріалізації об''єкта з JSON'"));
	
	Структура.Вставить("НеверныйШаблонВалидации",
		НСтр("en = 'Invalid validation pattern';
		|ru = 'Неверный шаблон валидации';
		|uk = 'Некоректний шаблон валідації'"));
	
КонецПроцедуры
	
Процедура ДополнитьСтроковымиЗначениямиОшибокВалидации(Структура)

	Структура.Вставить("ВалидацииОпущенПараметр",
		НСтр("en = 'Required request parameter ''%1'' is missing';
		|ru = 'Опущен обязательный параметр запроса ''%1''';
		|uk = 'Пропущено обов''язковий параметр запиту ''%1'''"));
	
	Структура.Вставить("ВалидацииПараметрНеЗаполнен",
		НСтр("en = 'The value of request parameter ''%1'' must be specified';
		|ru = 'Значение параметра запроса ''%1'' должно быть задано';
		|uk = 'Значення параметра запиту ''%1'' має бути задано'"));
	
	Структура.Вставить("ВалидацииПараметрДолженБытьЧислом",
		НСтр("en = 'Request parameter ''%1'' must be a number';
		|ru = 'Параметр запроса ''%1'' должен быть числом';
		|uk = 'Параметр запиту ''%1'' має бути числом'"));
	
КонецПроцедуры

#КонецОбласти
