////////////////////////////////////////////////////////////////////////////////
// Подсистема Кубус
// https://github.com/ibrusniak/Qubus
//
// Модуль 'КубусОбщегоНазначенияКлиентСервер'
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Работа с JSON

Функция СериализацияВJson(Объект) Экспорт

	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJson.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	
	Попытка
		ЗаписатьJSON(ЗаписьJson, Объект);
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение
			КубусСтроковыеЗначенияКлиентСервер.Все().Ошибки.СериализацииВJson +
			": " + ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке);
		
	КонецПопытки;
	
	Возврат ЗаписьJson.Закрыть();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Прочие

Функция ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке) Экспорт
	
	Описание = ИнформацияОбОшибке.Описание;
	
	Если ИнформацияОбОшибке.Причина <> Неопределено Тогда
		Описание = Описание + " -> " +
		ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке.Причина);
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти
