////////////////////////////////////////////////////////////////////////////////
// Подсистема Кубус
// https://github.com/ibrusniak/Qubus
//
// Модуль 'КубусОбщегоНазначенияКлиентСервер'
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Работа с JSON

Функция СериализацияВJson(Объект) Экспорт

	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJson.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	
	Попытка
		ЗаписатьJSON(ЗаписьJson, Объект);
	Исключение
		
		ЗаписьJson.Закрыть();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение
			КубусСтроковыеЗначенияКлиентСервер.Все().Ошибки.СериализацииВJson +
			": " + ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке);
		
	КонецПопытки;
	
	Возврат ЗаписьJson.Закрыть();
	
КонецФункции

Функция ДесериализоватьJsonВСоответствие(Json) Экспорт

	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Json);
	
	Попытка
		Соответствие = ПрочитатьJSON(ЧтениеJSON, Истина);
	Исключение
		
		ЧтениеJSON.Закрыть();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение
			КубусСтроковыеЗначенияКлиентСервер.Все().Ошибки.ДесериализацииИзJson +
			": " + ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке);
		
	КонецПопытки;

	ЧтениеJSON.Закрыть();
	Возврат Соответствие;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Прочие

Функция ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке) Экспорт
	
	Описание = ИнформацияОбОшибке.Описание;
	
	Если ИнформацияОбОшибке.Причина <> Неопределено Тогда
		Описание = Описание + " -> " +
		ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке.Причина);
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти
