
Функция RequestGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ШаблонВалидацииJSON = Запрос.ПолучитьТелоКакСтроку();
	
	ТелоОтвета = "";
	
	Попытка
		
		РезультатВалидации = КубусВалидацияСервер.ВалидацияПараметровHTTPЗапроса(Запрос, ШаблонВалидацииJSON);
		ТелоОтвета = ТелоОтвета + "Валидация пройдена: " + РезультатВалидации.ВалидацияПройдена + Символы.ПС + Символы.ПС;
		
		Для каждого Строка Из РезультатВалидации.ОшибкиВалидации Цикл
			ТелоОтвета = ТелоОтвета + Строка + Символы.ПС;
		КонецЦикла;
		
	Исключение
		ТелоОтвета = ОписаниеОшибки();
	КонецПопытки;
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета, КодировкаТекста.UTF8);
	Возврат Ответ;
	
КонецФункции
